type HomeSearchType = {
    [key: string]: string[]
}
export const HomeSearch: HomeSearchType = {
    基隆市: ['仁愛區', '信義區', '中正區', '中山區', '安樂區', '七堵區'],
    臺北市: [
        '中正區',
        '大同區',
        '中山區',
        '松山區',
        '大安區',
        '萬華區',
        '信義區',
        '士林區',
        '北投區',
        '內湖區',
        '南港區',
        '文山區',
    ],
    新北市: [
        '板橋區',
        '新莊區',
        '中和區',
        '永和區',
        '土城區',
        '樹林區',
        '三峽區',
        '鶯歌區',
        '三重區',
        '蘆洲區',
        '五股區',
        '泰山區',
        '林口區',
        '八里區',
        '淡水區',
        '三芝區',
        '石門區',
        '金山區',
        '萬里區',
        '汐止區',
        '瑞芳區',
        '貢寮區',
        '平溪區',
        '雙溪區',
        '新店區',
        '深坑區',
        '石碇區',
        '坪林區',
        '烏來區',
    ]
}

export const memberPath = [
    ['info', '會員資料'],
    ['tickets', '我的電影票'],
    ['favorites', '我的收藏'],
    ['comments', '我的評論'],
    ['sharedTicket', '線上分票'],
]
