export const COUNTRIES = [
    {
        label: '台北市',
        value: '0',
        defaultPosition: { lat: 25.03568146327801, lng: 121.56741187658531 },
    },
    {
        label: '新北市',
        value: '1',
        defaultPosition: { lat: 25.014257605446936, lng: 121.46740416024275 },
    },
    {
        label: '桃園市',
        value: '2',
        defaultPosition: { lat: 24.991264291372964, lng: 121.31285339464473 },
    },
    {
        label: '台中市',
        value: '3',
        defaultPosition: { lat: 24.140555036661205, lng: 120.69000420440348 },
    },
    {
        label: '台南市',
        value: '4',
        defaultPosition: { lat: 22.947374916579125, lng: 120.22064512714205 },
    },
    {
        label: '高雄市',
        value: '5',
        defaultPosition: { lat: 22.6128860280345, lng: 120.3046252043673 },
    },
]

export const THEATERS = [
    [
        {
            label: '信義威秀影城',
            value: '信義威秀影城',
            position: [25.03568146327801, 121.56741187658531],
        },
        {
            label: 'MUVIE CINEMAS松仁威秀',
            value: 'MUVIE CINEMAS松仁威秀',
            position: [25.03699032624789, 121.56900172297868],
        },
        {
            label: '京站威秀影城',
            value: '京站威秀影城',
            position: [25.049177073876038, 121.51859231235063],
        },
        {
            label: '長春國賓影城',
            value: '長春國賓影城',
            position: [25.054742144469767, 121.53464223511801],
        },
        {
            label: '欣欣秀泰影城',
            value: '欣欣秀泰影城',
            position: [25.054457102887543, 121.52582824118745],
        },
        {
            label: '美麗華大直影城',
            value: '美麗華大直影城',
            position: [25.08325335737759, 121.55749709565823],
        },
        {
            label: '天母新光影城',
            value: '天母新光影城',
            position: [25.117391020972402, 121.5339615681701],
        },
        {
            label: '誠品電影院',
            value: '誠品電影院',
            position: [25.044650160216964, 121.56131907002356],
        },
        {
            label: '國賓大戲院',
            value: '國賓大戲院',
            position: [25.043431250800833, 121.50511358487856],
        },
        {
            label: '獅子林新光影城',
            value: '獅子林新光影城',
            position: [25.045429858294145, 121.50670403326247],
        },
        {
            label: '今日秀泰影城',
            value: '今日秀泰影城',
            position: [25.04378268029417, 121.50593738115523],
        },
        {
            label: '喜滿客影城南港店',
            value: '喜滿客影城南港店',
            position: [25.053477628817063, 121.60693971418674],
        },
        {
            label: '光點華山電影館',
            value: '光點華山電影館',
            position: [25.0453150383728, 121.52957752162705],
        },
        {
            label: '光點台北',
            value: '光點台北',
            position: [25.053702767297697, 121.52606914592226],
        },
        {
            label: '美麗新大直皇家影城',
            value: '美麗新大直皇家影城',
            position: [25.08509676353723, 121.55408917744579],
        },
    ],
    [
        {
            label: '板橋大遠百威秀影城',
            value: '板橋大遠百威秀影城',
            position: [25.014257605446936, 121.46740416024275],
        },
        {
            label: '中和環球威秀影城',
            value: '中和環球威秀影城',
            position: [25.006857116583497, 121.4748218123498],
        },
        {
            label: '喜樂時代影城永和店',
            value: '喜樂時代影城永和店',
            position: [25.008335376478925, 121.50793886024269],
        },
        {
            label: '晶冠廣場國賓影城',
            value: '晶冠廣場國賓影城',
            position: [25.064089181889237, 121.45945015231946],
        },
        {
            label: '天台影城',
            value: '天台影城',
            position: [25.06187230255916, 121.49746964304295],
        },
        {
            label: '樹林秀泰影城',
            value: '樹林秀泰影城',
            position: [24.99567832934227, 121.42888197929864],
        },
        {
            label: '鴻金寶麻吉影城',
            value: '鴻金寶麻吉影城',
            position: [25.023241691923243, 121.42525633697244],
        },
        {
            label: '美麗新宏匯影城',
            value: '美麗新宏匯影城',
            position: [25.059833817892837, 121.44952961977215],
        },
        {
            label: '林口昕境國賓影城',
            value: '林口昕境國賓影城',
            position: [25.073932615533195, 121.36950218486646],
        },
        {
            label: '美麗新淡海影城',
            value: '美麗新淡海影城',
            position: [25.199135963664556, 121.439060321631],
        },
        {
            label: '淡水禮萊國賓影城',
            value: '淡水禮萊國賓影城',
            position: [25.178065125361478, 121.44149260576918],
        },
        {
            label: '板橋秀泰影城',
            value: '板橋秀泰影城',
            position: [25.012461626928737, 121.46209957187804],
        },
        {
            label: '土城秀泰影城',
            value: '土城秀泰影城',
            position: [24.978865957428166, 121.44581197137352],
        },
        {
            label: '新店裕隆城威秀影城',
            value: '新店裕隆城威秀影城',
            position: [24.978187407506105, 121.54712172719141],
        },
        {
            label: '板橋林園電影城',
            value: '板橋林園電影城',
            position: [25.00876448426789, 121.45536652348146],
        },
    ],
    [
        {
            label: '統領威秀影城',
            value: '統領威秀影城',
            position: [24.991264291372964, 121.31285339464473],
        },
        {
            label: '八德置地國賓影城',
            value: '八德置地國賓影城',
            position: [24.96511604176241, 121.2988642853674],
        },
        {
            label: '美麗新台茂影城',
            value: '美麗新台茂影城',
            position: [25.053669997179867, 121.28867178536971],
        },
        {
            label: '青埔新光影城',
            value: '青埔新光影城',
            position: [25.01697594595362, 121.21345681234997],
        },
        {
            label: '喜樂時代影城A19店',
            value: '喜樂時代影城A19店',
            position: [25.002108182890428, 121.2013797863755],
        },
        {
            label: '威尼斯影城',
            value: '威尼斯影城',
            position: [24.961716684445815, 121.22436569885801],
        },
    ],
    [
        {
            label: '中港新光影城',
            value: '中港新光影城',
            position: [24.18015634601677, 120.70591945522109],
        },
        {
            label: '大遠百威秀影城',
            value: '大遠百威秀影城',
            position: [24.181941986051797, 120.68394470776947],
        },
        {
            label: 'TIGER CITY威秀影城',
            value: 'TIGER CITY威秀影城',
            position: [24.164443020466155, 120.63873812717105],
        },
        {
            label: '文心秀泰影城',
            value: '文心秀泰影城',
            position: [24.12986129208578, 120.64607753323969],
        },
        {
            label: '站前秀泰影城',
            value: '站前秀泰影城',
            position: [24.140555036661205, 120.69000420440348],
        },
        {
            label: '大魯閣新時代威秀影城',
            value: '大魯閣新時代威秀影城',
            position: [24.135997769162316, 120.688273409969],
        },
        {
            label: '日日新影城',
            value: '日日新影城',
            position: [24.14379820385941, 120.67593635600717],
        },
        {
            label: '麗寶秀泰影城',
            value: '麗寶秀泰影城',
            position: [24.32631905121072, 120.70191052717502],
        },
    ],
    [
        {
            label: '大遠百威秀影城',
            value: '大遠百威秀影城',
            position: [22.995523799652528, 120.20641271972208],
        },
        {
            label: '南紡威秀影城',
            value: '南紡威秀影城',
            position: [22.991501210683968, 120.23356663135726],
        },
        {
            label: 'Focus威秀影城',
            value: 'Focus威秀影城',
            position: [22.99568576557192, 120.21044983506793],
        },
        {
            label: '西門新光影城',
            value: '西門新光影城',
            position: [22.986906979001194, 120.19940854063346],
        },
        {
            label: '仁德秀泰影城',
            value: '仁德秀泰影城',
            position: [22.947374916579125, 120.22064512714205],
        },
        {
            label: '國賓影城',
            value: '國賓影城',
            position: [22.996593027022346, 120.23465533506807],
        },
        {
            label: '南台影城',
            value: '南台影城',
            position: [22.992514015237653, 120.19561369274062],
        },
    ],
    [
        {
            label: '大遠百威秀影城',
            value: '大遠百威秀影城',
            position: [22.6128860280345, 120.3046252043673],
        },
        {
            label: 'SKM Park國賓影城',
            value: 'SKM Park國賓影城',
            position: [22.583063697657096, 120.33235905290044],
        },
        {
            label: '義大國賓影城',
            value: '義大國賓影城',
            position: [22.733954208580226, 120.41771493436886],
        },
        {
            label: '大立in89豪華影城',
            value: '大立in89豪華影城',
            position: [22.621945361045064, 120.29860256204043],
        },
        {
            label: '鹽埕in89駁二電影院',
            value: '鹽埕in89駁二電影院',
            position: [22.620910934995948, 120.2817508699653],
        },
        {
            label: '台鋁影城',
            value: '台鋁影城',
            position: [22.60413006371058, 120.30406377553068],
        },
        {
            label: '喜樂時代影城總圖店',
            value: '喜樂時代影城總圖店',
            position: [22.609415813833838, 120.30299109829774],
        },
        {
            label: '環球影城',
            value: '環球影城',
            position: [22.632307327165066, 120.32573709273234],
        },
        {
            label: '岡山秀泰影城',
            value: '岡山秀泰影城',
            position: [22.780091226761424, 120.30088008666641],
        },
        {
            label: '夢時代秀泰影城',
            value: '夢時代秀泰影城',
            position: [22.59503479152392, 120.30790344433521],
        },
        {
            label: '內惟藝術中心',
            value: '內惟藝術中心',
            position: [22.657401296279833, 120.28245620065772],
        },
        {
            label: '高雄市電影館',
            value: '高雄市電影館',
            position: [22.622711856366738, 120.28907630065707],
        },
    ],
]

export const MOVIES = [
    { label: '腦筋急轉彎2', value: '腦筋急轉彎2' },
    { label: '絕地戰警：生死與共', value: '絕地戰警：生死與共' },
    {
        label: '劇場版 排球少年！！ 垃圾場的決戰',
        value: '劇場版 排球少年！！ 垃圾場的決戰',
    },
    { label: '屍油降', value: '屍油降' },
    { label: '亡命機劫', value: '亡命機劫' },
    { label: '承諾大海的老師', value: '承諾大海的老師' },
    { label: '金孫爆富攻略', value: '金孫爆富攻略' },
    { label: '媽的人生願望', value: '媽的人生願望' },
]
